In [1]:
import pandas as pd;

In [22]:
df=pd.read_json('data.json')

In [23]:
df.head(5)

           Name  Age       City              Profession
0  Aarav Sharma   32  Bangalore    Blockchain Developer
1  Vihaan Mehta   30  Hyderabad  Smart Contract Auditor
2  Ishaan Reddy   35       Pune    Full Stack Developer
3  Advait Desai   28    Chennai       Backend Developer
4   Kunal Joshi   33     Mumbai         DevOps Engineer

In [24]:
df.tail(5)

           Name  Age      City                    Profession
45  Kritin Paul   36  Itanagar      IoT Blockchain Developer
46  Shaunak Dey   35    Imphal     Software Systems Engineer
47  Aviraj Giri   33    Kohima  Web3 Infrastructure Engineer
48  Neil Chetri   30   Gangtok    AI Infrastructure Engineer
49    Ronav Rai   27      Puri      Cybersecurity Researcher

In [25]:
df.describe()

            Age
count  50.00000
mean   32.36000
std     3.67429
min    26.00000
25%    30.00000
50%    32.00000
75%    35.00000
max    40.00000

In [26]:
df.dtypes

Name          object
Age            int64
City          object
Profession    object
dtype: object

In [27]:
## Handeling missing value
df.isnull().tail(6)

     Name    Age   City  Profession
44  False  False  False       False
45  False  False  False       False
46  False  False  False       False
47  False  False  False       False
48  False  False  False       False
49  False  False  False       False

In [28]:
df[df.isnull()].tail(5)

   Name  Age City Profession
45  NaN  NaN  NaN        NaN
46  NaN  NaN  NaN        NaN
47  NaN  NaN  NaN        NaN
48  NaN  NaN  NaN        NaN
49  NaN  NaN  NaN        NaN

In [29]:
df[df.isnull()].any(axis=1).tail(5)

45    False
46    False
47    False
48    False
49    False
dtype: bool

In [35]:
df_filled=df.fillna('Hello')

# Fill missing value with Remote where city is missing

In [ ]:
df['City_fillna']=df['City'].fillna('Remote')

In [38]:
df.head(10)

            Name  Age       City                Profession City_fillna
0   Aarav Sharma   32  Bangalore      Blockchain Developer   Bangalore
1   Vihaan Mehta   30  Hyderabad    Smart Contract Auditor   Hyderabad
2   Ishaan Reddy   35       Pune      Full Stack Developer        Pune
3   Advait Desai   28    Chennai         Backend Developer     Chennai
4    Kunal Joshi   33     Mumbai           DevOps Engineer      Mumbai
5    Rudra Gupta   29  Ahmedabad            Data Scientist   Ahmedabad
6  Laksh Agarwal   40      Delhi            AI/ML Engineer       Delhi
7    Yuvraj Nair   31        NaN      Blockchain Architect      Remote
8    Arjun Patel   27        NaN        Frontend Developer      Remote
9    Devansh Rao   34        NaN  Cloud Solutions Engineer      Remote

# Renaming column

In [43]:
df=df.rename(columns={'City':'Working Location'})
df.head()

           Name  Age Working Location              Profession City_fillna
0  Aarav Sharma   32        Bangalore    Blockchain Developer   Bangalore
1  Vihaan Mehta   30        Hyderabad  Smart Contract Auditor   Hyderabad
2  Ishaan Reddy   35             Pune    Full Stack Developer        Pune
3  Advait Desai   28          Chennai       Backend Developer     Chennai
4   Kunal Joshi   33           Mumbai         DevOps Engineer      Mumbai

# Change datatypes

In [44]:
# df['new_column_name']=df[''Column_name'].astype(float)

# Apply operation in each column using lamda function

In [47]:
df['New Work Location']=df['Working Location'].apply(lambda x:x+x)
df.head()

,Name,Age,Working Location,Profession,City_fillna,New Work Location
0,Aarav Sharma,32,Bangalore,Blockchain Developer,Bangalore,BangaloreBangalore
1,Vihaan Mehta,30,Hyderabad,Smart Contract Auditor,Hyderabad,HyderabadHyderabad
2,Ishaan Reddy,35,Pune,Full Stack Developer,Pune,PunePune
3,Advait Desai,28,Chennai,Backend Developer,Chennai,ChennaiChennai
4,Kunal Joshi,33,Mumbai,DevOps Engineer,Mumbai,MumbaiMumbai

# Data Aggregating

In [56]:
group_by=df.groupby(['Working Location'])['Name']
print(group_by)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x721b760261b0>

# Aggregate using multiple function

In [60]:
group_by_agg=df.groupby('Working Location')['Name'].agg(['count'])
print(group_by_agg.head())

                  count
Working Location
Agartala              1
Ahmedabad             1
Amritsar              1
Asansol               1
Bangalore             1

# Merging

In [65]:
df1=pd.DataFrame({'Key':[1,2,3,4],'Value1':['A','B','C','D']})
df2=pd.DataFrame({'Key':[1,2,3,4],'Value1':['E','F','G','H']})
pd.merge(df1,df2,on='Key',how='inner') # dataframes, based on key or something and then join name how inner or anything else.

   Key Value1_x Value1_y
0    1        A        E
1    2        B        F
2    3        C        G
3    4        D        H

In [69]:
pd.merge(df1,df2,on='Key',how='outer')

   Key Value1_x Value1_y
0    1        A        E
1    2        B        F
2    3        C        G
3    4        D        H

In [71]:
pd.merge(df1,df2,how='left',on='Key')

   Key Value1_x Value1_y
0    1        A        E
1    2        B        F
2    3        C        G
3    4        D        H